app/views/concerts/_concerts.html.erb

<% if params[:band_id] %>
<% band = Band.find_by_id(params[:band_id]) %>
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]