app/views/concerts/_concerts.html.erb

SELECT "bands".* FROM "bands"
SELECT "concerts".* FROM "concerts" WHERE "concerts"."band_id" = ? AND (date < '2020-10-12 14:58:55.259476')  [["band_id", 1]]
SELECT 1 AS one FROM "concerts" WHERE "concerts"."band_id" = ? AND (date >= '2020-10-16 19:27:03.754367') LIMIT ?  [["band_id", 1], ["LIMIT", 1]]
SELECT "concerts".* FROM "concerts" WHERE "concerts"."band_id" = ?  [["band_id", 1]]
---
<% if !band? %>
<% Band.all.each do |band| %>
<% if !band.concerts.current_show.empty? %>
<h2><%= link_to band.name, band_path(band) %></h2>
    <% band.concerts.current_show.each do |concert| %>

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <h3><%= link_to concert.date, concert_path(concert) %></h3>
        <p><%= concert.venue.search %> </p>

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h3><%= link_to concert.date, concert_path(concert) %></h3>
<p><%= concert.venue.search %> </p>