app/views/concerts/_form.html.erb

SELECT "venues".* FROM "venues"
---
    <% else %>
    <p>Venues <%= f.collection_select(:venue_id, Venue.all, :id, :name, include_blank: 'Choose One') %></p><br>