app/views/concerts/_search.html.erb

        <% if !band? %>
        <%= select_tag "band", options_from_collection_for_select(Band.all, "id", "name"), include_blank: "Bands" %>
---
SELECT "bands".* FROM "bands"

        <% end %>
        <%= select_tag "venue", options_from_collection_for_select(Venue.all, "id", "search"), include_blank: "Venues" %>
---
SELECT "venues".* FROM "venues"