app/views/concerts/index.html.erb

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h3><%= link_to concert.date, concert_path(concert) %></h3>
<p><%= concert.venue.search %> </p>