app/views/concerts/index.html.erb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "concerts".* FROM "concerts" WHERE "concerts"."concerts" IN (?, ?)  [["concerts", "venue"], ["concerts", "1"]]
---
<% if params[:band_id] %>
<% band = Band.find_by_id(params[:band_id]) %>
<h1><%= band.name %> Concerts</h1>
<% band.concerts.each do |concert| %>