app/views/concerts/new.html.erb

SELECT "venues".* FROM "venues"
---
    <% end %>
    <p>Venues <%= f.collection_select(:venue_id, Venue.all, :id, :name, include_blank: 'Choose One') %></p>