app/helpers/concerts_helper.rb

    def band?
        if params[:band_id]
            band = Band.find_by_id(params[:band_id])
        elsif params[:band] == "Band"
            band = current_user.band
        elsif params[:band]
            band = Band.find_by(name: params[:band])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]