app/helpers/users_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def current_user
        if session[:user_id]
            User.find(session[:user_id])