app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def find_band
        @band = Band.find(params[:id])