app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Apple Jacks"], ["genre", "Pop"], ["created_at", "2020-09-30 01:00:41.426299"], ["updated_at", "2020-09-30 01:00:41.426299"]]
UPDATE "bands" SET "genre" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["genre", "Pop Punk"], ["city", "Coral Springs"], ["state", "Florida"], ["updated_at", "2020-10-14 13:56:39.225006"], ["id", 6]]
---
    def create
        @band = Band.create(band_params)
        if @band.save

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = ?, "genre" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "Helium"], ["genre", ""], ["updated_at", "2020-10-08 01:16:34.153858"], ["id", 4]]
---
    def update

        @band = Band.find(params[:id])
        if current_user.band = @band
            @band.update(band_params)

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @band = Band.find(params[:id])