app/controllers/concerts_controller.rb

    def create
        @concert = @band.concerts.new(concert_params)
        if @concert.save
---
INSERT INTO "concerts" ("date", "admission", "band_id", "venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-10-03"], ["admission", 10], ["band_id", 3], ["venue_id", 2], ["created_at", "2020-10-01 21:17:49.799924"], ["updated_at", "2020-10-01 21:17:49.799924"]]

    def update
        @concert.update(concert_params)
---
UPDATE "concerts" SET "venue_id" = ?, "updated_at" = ? WHERE "concerts"."id" = ?  [["venue_id", 5], ["updated_at", "2020-09-29 18:38:21.838485"], ["id", 1]]

    def set_concert
        @concert = Concert.find(params[:id])
---
SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]