app/controllers/concerts_controller.rb

SELECT "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "concerts".* FROM "concerts"
SELECT "bands".* FROM "bands"
SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def index
        @bands = Band.all
        @concerts = {}
        if !search_params.blank?
            if !search_params[:band].blank?
                band = Band.find(search_params[:band])
                @concerts = band.concerts.search(search_params).current_show
            else
                @bands.each do |band|
                    @concerts.merge!({"#{band.id}" => band.concerts.search(search_params).current_show })
                end
            end
        elsif params[:band_id]
            band = Band.find_by_id(params[:band_id])
            @concerts = band.concerts.current_show
            @past = band.concerts.past_show
        else
            @bands.each do |band|

INSERT INTO "concerts" ("date", "admission", "band_id", "venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-10-31"], ["admission", 10], ["band_id", 1], ["venue_id", 4], ["created_at", "2020-10-11 01:44:30.490763"], ["updated_at", "2020-10-11 01:44:30.490763"]]
---
    def create
        @concert = @band.concerts.new(concert_params)
        if @concert.save

UPDATE "concerts" SET "venue_id" = ?, "updated_at" = ? WHERE "concerts"."id" = ?  [["venue_id", 2], ["updated_at", "2020-10-12 02:17:39.880132"], ["id", 5]]
---
    def update
        @concert.update(concert_params)

DELETE FROM "concerts" WHERE "concerts"."id" = ?  [["id", 1]]
---
    def destroy
        @concert.destroy

SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_concert
        @concert = Concert.find(params[:id])