app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "luckedout"], ["LIMIT", 1]]
---
    def create
            user = User.find_by(username: params[:user][:username])

SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "108288835639242591264"], ["LIMIT", 1]]
---
    def google
        @user = User.find_or_create_by(uid: auth['uid']) do |u|