app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.band = Band.find_or_create_by(name: params[:user][:band])
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "band_id", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mineral"], ["created_at", "2020-09-30 00:42:33.643601"], ["updated_at", "2020-09-30 00:42:33.643601"]]
SELECT "bands".* FROM "bands" WHERE "bands"."name" = ? LIMIT ?  [["name", "Mineral"], ["LIMIT", 1]]
UPDATE "users" SET "band_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["band_id", 3], ["updated_at", "2020-10-14 00:42:39.140291"], ["id", 3]]
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "#<Band:0x00007fbeec01dda0>"], ["created_at", "2020-10-08 01:14:35.928792"], ["updated_at", "2020-10-08 01:14:35.928792"]]
INSERT INTO "users" ("username", "password_digest", "email", "band_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)