app/controllers/venues_controller.rb

    def index
        @venues = Venue.all
---
SELECT "venues".* FROM "venues"

    def create
        @venue = Venue.create(venue_params)
---
INSERT INTO "venues" ("location", "crowd_capacity", "parking", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?)  [["location", "Mom's House"], ["crowd_capacity", 50], ["parking", 1], ["created_at", "2020-09-27 22:15:08.824490"], ["updated_at", "2020-09-27 22:15:08.824490"], ["name", "Basement"]]

    def update
        @venue.update(venue_params)
---
UPDATE "venues" SET "name" = ?, "crowd_capacity" = ?, "updated_at" = ? WHERE "venues"."id" = ?  [["name", "Ritaco Center"], ["crowd_capacity", 10000], ["updated_at", "2020-10-12 01:48:08.649399"], ["id", 3]]

    def set_venue
        @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]