app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @venue = Venue.find_by_id(params[:id])